def f1(p1, p2, *p3):
    print(p1)
    print(p2)
    print(p3)

f1(1, 2, 3, 4, 5, 6, 7)
#f1(p1=10, p2=20, 1, 2, 3, 4, 5) # 에러 :포지션아규먼트, 키워드 아규먼트 순이어야 함
#f1(1, 2, 3, 4, 5, p1=10, p2=20) # 에러 : p1에 다중 값
print("-"*30)
def f2(*p1, p2, p3):
    print(p1)
    print(p2)
    print(p3)

#f2(1, 2, 3, 4, 5, 6, 7)
f2(1, 2, 3, 4, 5, p2=10, p3=20)
print("-"*30)
def f3(p1=100, p2=200, *p3):
    print(p1)
    print(p2)
    print(p3)

f3(1, 2, 3, 4, 5, 6, 7)
#f3(1, 2, 3, 4, 5, p1=10, p2=20) # 에러 : p1에 다중 값
print("-"*30)
def f4(*p1, p2=100, p3=200):
    print(p1)
    print(p2)
    print(p3)

f4(1, 2, 3, 4, 5, 6, 7)
f2(1, 2, 3, 4, 5, p2=10, p3=20)

########
# 결론 #
########
# 가변아규먼트 매개변수
# 가변아규먼트 매개변수, 기본값을 갖는 매개변수
# 일반 매개변수, 가변아규먼트 매개변수


