dic={
    "김주영":{"나이":"26"
           ,"거주지역":"서울 강동구"
            ,"메일주소":"jooyoung0903@naver.com"
            ,"취미":"게임(리듬,RPG)"
            ,"좋아하는음식":"과일,면"
            },
    "강지우": {"나이":"28"
            , "거주지역":"경기도 구리"
            , "메일주소":"jwkang1124@naver.com"
            , "취미":"영화,독서"
            , "좋아하는음식":"마카롱"
            },
    "양현지": {"나이": "26"
        , "거주지역": "서울 중남구"
        , "메일주소": "yhg0725@naver.com"
        , "취미": "노래"
        , "좋아하는음식": "떡볶이,마라탕"
            },
    "정현석": {"나이": "26"
        , "거주지역": "서울 강서구"
        , "메일주소": "ark1159@naver.com"
        , "취미": "축구"
        , "좋아하는음식": "치킨,고기"
            }
}
for data in dic:
    print(f'{data}   {dic[data]["나이"]}   {dic[data]["거주지역"]}   {dic[data]["메일주소"]}'
    f'  {dic[data]["취미"]}   {dic[data]["좋아하는음식"]}')