team = {
    '조원형' : {
        '나이' : 26,
        '거주지' : '서울시 구로구',
        '이메일' : 'mesh153@naver.com',
        '취미' : ['기타치기','게임하기'],
        '좋아하는 음식' : '피자'
    },
    '양예담' : {
        '나이' : 20,
        '거주지' : '경기도 용인시',
        '이메일' : 'yedam0308917@gmail.com',
        '취미' : '넷플릭스 보기',
        '좋아하는 음식' : '초밥'
    },
    '박재현' : {
        '나이' : 27,
        '거주지' : '경상남도 밀양시',
        '이메일' : 'star3175@gmail.com',
        '취미' : ['배구','축구','자전거타기'],
        '좋아하는 음식' : '돼지 국밥'
    },
    '홍진수' : {
        '나이' : 27,
        '거주지' : '충청남도 천안시',
        '이메일' : 'dkdlfjs7894@naver.com',
        '취미' : '풋살',
        '좋아하는 음식' : '육회'
    }
}
for key, value in team.items():
    print(f"이름:{key}, 나이:{team[key]['나이']},거주지:{team[key]['거주지']}"
          f",이메일:{team[key]['이메일']},취미:{team[key]['취미']},좋아하는음식:{team[key]}")
